[
    {
        "title":"Full Stack Woes",
        "content":"A good full stack developer is like one of those celebrities who can do it all. They can act, sing, be a DJ, host a show, even direct, and produce! They may not have won an Oscar or a Grammy, but they still have the breadth of experience. They are capable of developing full-fledged applications (Web, mobile, or desktop). They understand both the front-end and back-end and know their way around servers, databases, APIs, MVC, and hosting environments among others.",
        "user_id":1
    },
    {
        "title":"A graphic design post",
        "content":"Nowadays, if you want to see the latest design work, find out who created it, what the challenges were and how they overcame them, there's a blog for that. Consequently, if you just want a quick blast of eye candy to inspire you visually, you're well catered for as well. Indeed, there are so many graphic design blogs out there right now; it's difficult to know which ones to pay the most attention to.",
        "user_id":2
    },
    {
        "title":"A cyber security post",
        "content":"Most of us have played with Snapchat’s Face Swap feature at least once. You might even have downloaded apps like Restart to up your meme-creation game by doctoring some gifs.But what, you might ask, have these novelty tools got to do with cyber security?",
        "user_id":3
    },
    {
        "title":"Node developement",
        "content":"These are vulnerabilities in the node-tar, arborist, and npm cli modules which are related to the initial reports and subsequent remediation of node-tar vulnerabilities CVE-2021-32803 and CVE-2021-32804. Subsequent internal security review of node-tar and additional external bounty reports have resulted in another 5 CVE being remediated in core npm CLI dependencies including node-tar, and npm arborist.",
        "user_id":1
    },
    {
        "title":"CSS Animation",
        "content":"Native CSS nesting is coming to browsers soon. With nesting, that you might be familiar with from Sass or Less, you can greatly cut down on writing repetitive selectors. But you can also really work yourself into a corner if you’re not careful. This is an overview of how you can already use it today, the pitfalls and how to avoid them.",
        "user_id":2
    },
    {
        "title":"Middleware",
        "content":"The Express middleware tools we’re going to discuss are must-haves for your initial Express.js app setup. We’ll show you how to get started with them, and you can further configure them according to your application’s unique needs.",
        "user_id":3
    }
]